; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_7 ?v3 ?v7)
             (pred_10 ?v2 ?v13)
             (pred_8 ?v3 ?v13)
             (pred_4 ?v4 ?v3 )
	     (pred_3 ?v3)
             (pred_2 ?v12)
             (pred_1 ?v2)
             (pred_9 ?v13)
             (pred_12 ?v3)
             (pred_5 ?v2)
             (pred_11 ?v3)
             (pred_6 ))



(:action op_4
:parameters (?v1 ?v8 ?v11 ?v10)
:precondition (and (pred_2 ?v1) (pred_2 ?v8) (pred_1 ?v11) (pred_9 ?v10)
          (pred_7 ?v1 ?v8) (pred_10 ?v11 ?v10)
                   (pred_8 ?v8 ?v10) (pred_3 ?v1) 
                   (pred_12 ?v8) (pred_5 ?v11))
:effect (and  (pred_11 ?v8) (not (pred_12 ?v8))))


(:action op_1
:parameters (?v1 ?v6)
:precondition (and (pred_2 ?v1) (pred_2 ?v6)
               (pred_3 ?v1) (pred_7 ?v1 ?v6) (pred_11 ?v6))
:effect (and (pred_3 ?v6) (not (pred_3 ?v1))))

(:action op_3
:parameters (?v1 ?v11)
:precondition (and (pred_2 ?v1) (pred_1 ?v11) 
                  (pred_3 ?v1) (pred_4 ?v11 ?v1) (pred_6 ))
:effect (and (pred_5 ?v11)
   (not (pred_4 ?v11 ?v1)) (not (pred_6 ))))


(:action op_2
:parameters (?v1 ?v9 ?v5)
:precondition (and (pred_2 ?v1) (pred_1 ?v9) (pred_1 ?v5)
                  (pred_3 ?v1) (pred_5 ?v5) (pred_4 ?v9 ?v1))
:effect (and (pred_5 ?v9) (pred_4 ?v5 ?v1)
        (not (pred_5 ?v5)) (not (pred_4 ?v9 ?v1))))

(:action op_5
:parameters (?v1 ?v11)
:precondition (and (pred_2 ?v1) (pred_1 ?v11) 
                  (pred_3 ?v1) (pred_5 ?v11))
:effect (and (pred_6 ) (pred_4 ?v11 ?v1) (not (pred_5 ?v11)))))

; problem
(define (problem grid-5-5-3-4-4)
    (:domain grid)
    (:objects
    obj_05 obj_01 obj_25 obj_08 obj_18 obj_06 obj_32 obj_30 obj_27 obj_09 obj_04 obj_10 obj_03 obj_15 obj_14 obj_02 obj_13 obj_20 obj_16 obj_24 obj_21 obj_26 obj_11 obj_22 obj_19
    obj_23 obj_17 obj_31
    obj_07 obj_29 obj_12 obj_28
    )

    (:init
       (pred_6)

       (pred_2 obj_05)
       (pred_2 obj_01)
       (pred_2 obj_25)
       (pred_2 obj_08)
       (pred_2 obj_18)
       (pred_2 obj_06)
       (pred_2 obj_32)
       (pred_2 obj_30)
       (pred_2 obj_27)
       (pred_2 obj_09)
       (pred_2 obj_04)
       (pred_2 obj_10)
       (pred_2 obj_03)
       (pred_2 obj_15)
       (pred_2 obj_14)
       (pred_2 obj_02)
       (pred_2 obj_13)
       (pred_2 obj_20)
       (pred_2 obj_16)
       (pred_2 obj_24)
       (pred_2 obj_21)
       (pred_2 obj_26)
       (pred_2 obj_11)
       (pred_2 obj_22)
       (pred_2 obj_19)
       (pred_9 obj_23)
       (pred_9 obj_17)
       (pred_9 obj_31)
       (pred_1 obj_07)
       (pred_1 obj_29)
       (pred_1 obj_12)
       (pred_1 obj_28)

       (pred_7 obj_05 obj_06)
       (pred_7 obj_05 obj_01)
       (pred_7 obj_01 obj_32)
       (pred_7 obj_01 obj_25)
       (pred_7 obj_01 obj_05)
       (pred_7 obj_25 obj_30)
       (pred_7 obj_25 obj_08)
       (pred_7 obj_25 obj_01)
       (pred_7 obj_08 obj_27)
       (pred_7 obj_08 obj_18)
       (pred_7 obj_08 obj_25)
       (pred_7 obj_18 obj_09)
       (pred_7 obj_18 obj_08)
       (pred_7 obj_06 obj_04)
       (pred_7 obj_06 obj_32)
       (pred_7 obj_06 obj_05)
       (pred_7 obj_32 obj_10)
       (pred_7 obj_32 obj_30)
       (pred_7 obj_32 obj_01)
       (pred_7 obj_32 obj_06)
       (pred_7 obj_30 obj_03)
       (pred_7 obj_30 obj_27)
       (pred_7 obj_30 obj_25)
       (pred_7 obj_30 obj_32)
       (pred_7 obj_27 obj_15)
       (pred_7 obj_27 obj_09)
       (pred_7 obj_27 obj_08)
       (pred_7 obj_27 obj_30)
       (pred_7 obj_09 obj_14)
       (pred_7 obj_09 obj_18)
       (pred_7 obj_09 obj_27)
       (pred_7 obj_04 obj_02)
       (pred_7 obj_04 obj_10)
       (pred_7 obj_04 obj_06)
       (pred_7 obj_10 obj_13)
       (pred_7 obj_10 obj_03)
       (pred_7 obj_10 obj_32)
       (pred_7 obj_10 obj_04)
       (pred_7 obj_03 obj_20)
       (pred_7 obj_03 obj_15)
       (pred_7 obj_03 obj_30)
       (pred_7 obj_03 obj_10)
       (pred_7 obj_15 obj_16)
       (pred_7 obj_15 obj_14)
       (pred_7 obj_15 obj_27)
       (pred_7 obj_15 obj_03)
       (pred_7 obj_14 obj_24)
       (pred_7 obj_14 obj_09)
       (pred_7 obj_14 obj_15)
       (pred_7 obj_02 obj_21)
       (pred_7 obj_02 obj_13)
       (pred_7 obj_02 obj_04)
       (pred_7 obj_13 obj_26)
       (pred_7 obj_13 obj_20)
       (pred_7 obj_13 obj_10)
       (pred_7 obj_13 obj_02)
       (pred_7 obj_20 obj_11)
       (pred_7 obj_20 obj_16)
       (pred_7 obj_20 obj_03)
       (pred_7 obj_20 obj_13)
       (pred_7 obj_16 obj_22)
       (pred_7 obj_16 obj_24)
       (pred_7 obj_16 obj_15)
       (pred_7 obj_16 obj_20)
       (pred_7 obj_24 obj_19)
       (pred_7 obj_24 obj_14)
       (pred_7 obj_24 obj_16)
       (pred_7 obj_21 obj_26)
       (pred_7 obj_21 obj_02)
       (pred_7 obj_26 obj_11)
       (pred_7 obj_26 obj_13)
       (pred_7 obj_26 obj_21)
       (pred_7 obj_11 obj_22)
       (pred_7 obj_11 obj_20)
       (pred_7 obj_11 obj_26)
       (pred_7 obj_22 obj_19)
       (pred_7 obj_22 obj_16)
       (pred_7 obj_22 obj_11)
       (pred_7 obj_19 obj_24)
       (pred_7 obj_19 obj_22)
       (pred_12 obj_25)
       (pred_12 obj_26)
       (pred_12 obj_30)
       (pred_12 obj_14)
       (pred_8  obj_25 obj_23)
       (pred_8  obj_26 obj_17)
       (pred_8  obj_30 obj_31)
       (pred_8  obj_14 obj_31)
       (pred_11 obj_05)
       (pred_11 obj_01)
       (pred_11 obj_08)
       (pred_11 obj_18)
       (pred_11 obj_06)
       (pred_11 obj_32)
       (pred_11 obj_27)
       (pred_11 obj_09)
       (pred_11 obj_04)
       (pred_11 obj_10)
       (pred_11 obj_03)
       (pred_11 obj_15)
       (pred_11 obj_02)
       (pred_11 obj_13)
       (pred_11 obj_20)
       (pred_11 obj_16)
       (pred_11 obj_24)
       (pred_11 obj_21)
       (pred_11 obj_11)
       (pred_11 obj_22)
       (pred_11 obj_19)

       (pred_10  obj_07 obj_23)
       (pred_10  obj_29 obj_17)
       (pred_10  obj_12 obj_31)
       (pred_10  obj_28 obj_23)
       (pred_4 obj_07 obj_20)
       (pred_4 obj_29 obj_09)
       (pred_4 obj_12 obj_11)
       (pred_4 obj_28 obj_01)
       (pred_3 obj_16)
    )

    (:goal (and
       (pred_4 obj_07 obj_01)
       (pred_4 obj_29 obj_08)
       (pred_4 obj_12 obj_22)
       (pred_4 obj_28 obj_25)
    ))
(:constraints
  (always (not (pred_3 obj_18)))
)
)

; plan
1. (op_1 obj_16 obj_20)
   deleted: (pred_3 obj_16)
   added: (pred_3 obj_20)
   goals met: 0 of 4
2. (op_3 obj_20 obj_07)
   deleted: (pred_4 obj_07 obj_20) (pred_6)
   added: (pred_5 obj_07)
   goals met: 0 of 4
3. (op_1 obj_20 obj_03)
   deleted: (pred_3 obj_20)
   added: (pred_3 obj_03)
   goals met: 0 of 4
4. (op_1 obj_03 obj_10)
   deleted: (pred_3 obj_03)
   added: (pred_3 obj_10)
   goals met: 0 of 4
5. (op_1 obj_10 obj_32)
   deleted: (pred_3 obj_10)
   added: (pred_3 obj_32)
   goals met: 0 of 4
6. (op_1 obj_32 obj_01)
   deleted: (pred_3 obj_32)
   added: (pred_3 obj_01)
   goals met: 0 of 4
7. (op_4 obj_01 obj_25 obj_07 obj_23)
   deleted: (pred_12 obj_25)
   added: (pred_11 obj_25)
   goals met: 0 of 4
8. (op_2 obj_01 obj_28 obj_07)
   deleted: (pred_5 obj_07) (pred_4 obj_28 obj_01)
   added: (pred_5 obj_28) (pred_4 obj_07 obj_01)
   goals met: 1 of 4
9. (op_1 obj_01 obj_32)
   deleted: (pred_3 obj_01)
   added: (pred_3 obj_32)
   goals met: 1 of 4
10. (op_1 obj_32 obj_10)
   deleted: (pred_3 obj_32)
   added: (pred_3 obj_10)
   goals met: 1 of 4
11. (op_1 obj_10 obj_03)
   deleted: (pred_3 obj_10)
   added: (pred_3 obj_03)
   goals met: 1 of 4
12. (op_1 obj_03 obj_15)
   deleted: (pred_3 obj_03)
   added: (pred_3 obj_15)
   goals met: 1 of 4
13. (op_1 obj_15 obj_16)
   deleted: (pred_3 obj_15)
   added: (pred_3 obj_16)
   goals met: 1 of 4
14. (op_1 obj_16 obj_22)
   deleted: (pred_3 obj_16)
   added: (pred_3 obj_22)
   goals met: 1 of 4
15. (op_5 obj_22 obj_28)
   deleted: (pred_5 obj_28)
   added: (pred_6) (pred_4 obj_28 obj_22)
   goals met: 1 of 4
16. (op_1 obj_22 obj_11)
   deleted: (pred_3 obj_22)
   added: (pred_3 obj_11)
   goals met: 1 of 4
17. (op_3 obj_11 obj_12)
   deleted: (pred_4 obj_12 obj_11) (pred_6)
   added: (pred_5 obj_12)
   goals met: 1 of 4
18. (op_1 obj_11 obj_22)
   deleted: (pred_3 obj_11)
   added: (pred_3 obj_22)
   goals met: 1 of 4
19. (op_2 obj_22 obj_28 obj_12)
   deleted: (pred_5 obj_12) (pred_4 obj_28 obj_22)
   added: (pred_5 obj_28) (pred_4 obj_12 obj_22)
   goals met: 2 of 4
20. (op_1 obj_22 obj_16)
   deleted: (pred_3 obj_22)
   added: (pred_3 obj_16)
   goals met: 2 of 4
21. (op_1 obj_16 obj_15)
   deleted: (pred_3 obj_16)
   added: (pred_3 obj_15)
   goals met: 2 of 4
22. (op_1 obj_15 obj_27)
   deleted: (pred_3 obj_15)
   added: (pred_3 obj_27)
   goals met: 2 of 4
23. (op_1 obj_27 obj_09)
   deleted: (pred_3 obj_27)
   added: (pred_3 obj_09)
   goals met: 2 of 4
24. (op_2 obj_09 obj_29 obj_28)
   deleted: (pred_5 obj_28) (pred_4 obj_29 obj_09)
   added: (pred_5 obj_29) (pred_4 obj_28 obj_09)
   goals met: 2 of 4
25. (op_1 obj_09 obj_27)
   deleted: (pred_3 obj_09)
   added: (pred_3 obj_27)
   goals met: 2 of 4
26. (op_1 obj_27 obj_08)
   deleted: (pred_3 obj_27)
   added: (pred_3 obj_08)
   goals met: 2 of 4
27. (op_5 obj_08 obj_29)
   deleted: (pred_5 obj_29)
   added: (pred_6) (pred_4 obj_29 obj_08)
   goals met: 3 of 4
28. (op_1 obj_08 obj_27)
   deleted: (pred_3 obj_08)
   added: (pred_3 obj_27)
   goals met: 3 of 4
29. (op_1 obj_27 obj_09)
   deleted: (pred_3 obj_27)
   added: (pred_3 obj_09)
   goals met: 3 of 4
30. (op_3 obj_09 obj_28)
   deleted: (pred_4 obj_28 obj_09) (pred_6)
   added: (pred_5 obj_28)
   goals met: 3 of 4
31. (op_1 obj_09 obj_27)
   deleted: (pred_3 obj_09)
   added: (pred_3 obj_27)
   goals met: 3 of 4
32. (op_1 obj_27 obj_08)
   deleted: (pred_3 obj_27)
   added: (pred_3 obj_08)
   goals met: 3 of 4
33. (op_1 obj_08 obj_25)
   deleted: (pred_3 obj_08)
   added: (pred_3 obj_25)
   goals met: 3 of 4
34. (op_5 obj_25 obj_28)
   deleted: (pred_5 obj_28)
   added: (pred_6) (pred_4 obj_28 obj_25)
   goals met: 4 of 4
